Revit 2027 API
CeramicPatternType Enumeration
 The enumerated type representing the permitted values for the asset property "CeramicPattern" from the "Ceramic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum CeramicPatternType
Public Enumeration CeramicPatternType
public enum class CeramicPatternType
type CeramicPatternType
Members
Member name | Value | Description
Custom | 1
None | 0
See Also
Reference
Autodesk.Revit.DB.Visual Namespace